# TopRailHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RailingType..::..TopRailHeight Property
RailingType Class See Also
---
The height of the top rail in the railing system.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double TopRailHeight { get; set; }
```

Visual Basic
---
```text
Public Property TopRailHeight As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double TopRailHeight {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for height must be between 0 and 30000 feet. |

# See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace